Revit 2024 API
ParametersOrder Enumeration
 The order of the parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum ParametersOrder
Visual Basic
Public Enumeration ParametersOrder
Visual C++
public enum class ParametersOrder
Members
Member name | Description
Ascending |  Sort parameters are in ascending(A-Z) order.
Descending |  Sort parameters are in descending(Z-A) order.
See Also
Autodesk.Revit.DB Namespace